# Цвета

platform_sides_color = (128 / 255, 32 / 255, 32 / 255)
platform_top_color = (69 / 255, 35 / 255, 30 / 255)
platform_wheels_color = (43 / 255, 42 / 255, 42 / 255)
wheels_color = (0, 0, 0)
background_color = (194 / 255, 234 / 255, 255/ 255)
shipments_color = (190 / 255, 142 / 255, 94 / 255)
field_color = (77 / 255, 112 / 255, 72 / 255)

# Константы измерений вагона и грузов

L = 13400    # Длина пола (мм)
Q = 21    # Масса тары (т)
DELTA = 3320 - 2870    # Максимальная разность ширины платформы и ширины груза (мм)
MIN_DIST = 150    # Минимальное расстояние между грузами на платформе (мм)
W = 2870    # Ширина пола (мм)
Lv = 6650    # Координата центра тяжести вагона относительно торцевого борта (мм)
Hv = 800    # Высота центра тяжести вагона (мм)
Hugr = 1310    # Высота пола от УГР (мм)
Svag = 7    # Наветренная поверхность вагона (м ** 2)
a22 = 1.2
a94 = 0.97
LL = 9720    # База платформы (мм)
mu = 0.5
Hpry = 150
Hpy = 150
Rgv = 0.108

