# Координаты

platform_verticies = (
    (1.25, -0.2, -5.5),
    (1.25, 0.2, -6),
    (-1.25, 0.2, -6),
    (-1.25, -0.2, -5.5),
    (1.25, -0.2, 5.5),
    (1.25, 0.2, 6),
    (-1.25, -0.2, 5.5),
    (-1.25, 0.2, 6)
)

platform_edges = (
    (0, 1),
    (0, 3),
    (0, 4),
    (2, 1),
    (2, 3),
    (2, 7),
    (6, 3),
    (6, 4),
    (6, 7),
    (5, 1),
    (5, 4),
    (5, 7)
)

back_wheels_platform_verticies = (
    (1.25, -0.8, -4.5),
    (1.25, -0.2, -5),
    (-1.25, -0.2, -5),
    (-1.25, -0.8, -4.5),
    (1.25, -0.8, -3.5),
    (1.25, -0.2, -3),
    (-1.25, -0.8, -3.5),
    (-1.25, -0.2, -3)
)

back_wheels_platform_edges = (
    (0, 1),
    (0, 3),
    (0, 4),
    (2, 1),
    (2, 3),
    (2, 7),
    (6, 3),
    (6, 4),
    (6, 7),
    (5, 1),
    (5, 4),
    (5, 7)
)

front_wheels_platform_verticies = (
    (1.25, -0.8, 3.5),
    (1.25, -0.2, 3),
    (-1.25, -0.2, 3),
    (-1.25, -0.8, 3.5),
    (1.25, -0.8, 4.5),
    (1.25, -0.2, 5),
    (-1.25, -0.8, 4.5),
    (-1.25, -0.2, 5)
)

front_wheels_platform_edges = (
    (0, 1),
    (0, 3),
    (0, 4),
    (2, 1),
    (2, 3),
    (2, 7),
    (6, 3),
    (6, 4),
    (6, 7),
    (5, 1),
    (5, 4),
    (5, 7)
)

# Цвета

platform_sides_color = (84 / 255, 115 / 255, 227 / 255)
platform_top_color = (69 / 255, 35 / 255, 30 / 255)
platform_wheels_color = (43 / 255, 42 / 255, 42 / 255)
wheels_color = (0, 0, 0)
background_color = (178 / 255, 237 / 255, 173 / 255, 0.5)
shipments_color = (199 / 255, 179 / 255, 131 / 255)

# Константы измерений вагона и грузов

L = 13400    # Длина пола (мм)
Q = 21    # Масса тары (т)
DELTA = 3320 - 2870    # Максимальная разность ширины платформы и ширины груза (мм)
MIN_DIST = 150    # Минимальное расстояние между грузами на платформе (мм)
W = 2870    # Ширина пола (мм)
Lv = 6650    # Координата центра тяжести вагона относительно торцевого борта (мм)
Hv = 800    # Высота центра тяжести вагона (мм)
Hugr = 1310    # Высота пола от УГР (мм)
Svag = 7    # Наветренная поверхность вагона (м ** 2)
a22 = 1.2
a94 = 0.97
LL = 9720    # База платформы (мм)
mu = 0.5
Hpry = 150
Hpy = 150
Rgv = 0.108

